<<<<<<< HEAD

* test
#+begin_src emacs-lisp :lexical t
(let* ((url consult-web-brave-url)
       (params `(("q" . ,(url-hexify-string "emacs"))
                 ("count" . "5")
                 ("page" . "0")))
       (headers  `(("User-Agent" . "Emacs:consult-web/0.1 (Emacs consult-web package; https://github.com/armindarvish/consult-web)")
                   ("Accept" . "application/json")
                   ("Accept-Encoding" . "gzip")
                   ("X-Subscription-Token" . ,(consult-web-expand-variable-function consult-web-brave-api-key))
                   ))
       (callback 'print)
       )
  (consult-web--url-retrieve url
                             :params params
                             :headers headers
                             :parser #'cw--url-parse-buffer
                             :callback
                             (lambda (attrs)
                               (when-let* ((raw-results (map-nested-elt attrs '("web" "results")))
                                           (annotated-results  (mapcar (lambda (item)
                                                                       (let*
                                                                           ((url (format "%s" (gethash "url" item)))
                                                                            (title (format "%s" (gethash "title" item)))
                                                                            (urlobj (and url (url-generic-parse-url url)))
                                                                            (domain (and (url-p urlobj) (url-domain urlobj)))
                                                                            (domain (and (stringp domain)
                                                                                         (propertize domain 'face 'font-lock-variable-name-face)))
                                                                            (path (and (url-p urlobj) (url-filename urlobj)))
                                                                            (path (and (stringp path)
                                                                                       (propertize path 'face 'font-lock-warning-face)))
                                                                            (search-url (consult-web--make-url-string consult-web-brave-search-url params))

                                                                            (decorated (concat title "\t"
                                                                                               (propertize " " 'display '(space :align-to center))
                                                                                               domain path
                                                                                               )))
                                                                         (propertize decorated
                                                                                     :source "Brave"
                                                                                     :title title
                                                                                     :url url
                                                                                     :search-url search-url
                                                                                     :query query)))

                                                                     raw-results)))

                               (funcall callback annotated-results)))))
#+end_src

#+RESULTS:
||||||| parent of 2f8257f (add indicator)
=======

* test
#+begin_src emacs-lisp :lexical t
(let* ((url consult-web-brave-url)
       (params `(("q" . ,(url-hexify-string "emacs"))
                 ("count" . "5")
                 ("page" . "0")))
       (headers  `(("User-Agent" . "Emacs:consult-web/0.1 (Emacs consult-web package; https://github.com/armindarvish/consult-web)")
                   ("Accept" . "application/json")
                   ("Accept-Encoding" . "gzip")
                   ("X-Subscription-Token" . ,(consult-web-expand-variable-function consult-web-brave-api-key))
                   ))
       (callback 'print)
       )
  (consult-web--url-retrieve url
                             :params params
                             :headers headers
                             :parser #'cw--url-parse-buffer
                             :callback
                             (lambda (attrs)
                               (when-let* ((raw-results (map-nested-elt attrs '("web" "results")))
                                           (annotated-results  (mapcar (lambda (item)
                                                                       (let*
                                                                           ((url (format "%s" (gethash "url" item)))
                                                                            (title (format "%s" (gethash "title" item)))
                                                                            (urlobj (and url (url-generic-parse-url url)))
                                                                            (domain (and (url-p urlobj) (url-domain urlobj)))
                                                                            (domain (and (stringp domain)
                                                                                         (propertize domain 'face 'font-lock-variable-name-face)))
                                                                            (path (and (url-p urlobj) (url-filename urlobj)))
                                                                            (path (and (stringp path)
                                                                                       (propertize path 'face 'font-lock-warning-face)))
                                                                            (search-url (consult-web--make-url-string consult-web-brave-search-url params))

                                                                            (decorated (concat title "\t"
                                                                                               (propertize " " 'display '(space :align-to center))
                                                                                               domain path
                                                                                               )))
                                                                         (propertize decorated
                                                                                     :source "Brave"
                                                                                     :title title
                                                                                     :url url
                                                                                     :search-url search-url
                                                                                     :query query)))

                                                                     raw-results)))

                               (funcall callback annotated-results)))))
#+end_src

#+RESULTS:
>>>>>>> 2f8257f (add indicator)
